tunr_mini_api/app/controllers/songs_controller.rb

  def index
        songs = Song.all
---
SELECT "songs".* FROM "songs"

  def show
    song = Song.find(params[:id])
---
SELECT "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

  def create
    song = Song.new(song_params)
    if song.save
---
INSERT INTO "songs" ("title", "artist", "time", "fav", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "mysong"], ["artist", "b-man"], ["time", "2:31"], ["fav", false], ["created_at", "2020-11-16 16:40:05.324978"], ["updated_at", "2020-11-16 16:40:05.324978"]]

  def update
    song = Song.find(params[:id])
    song.update(song_params)
---
SELECT "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
UPDATE "songs" SET "title" = $1, "updated_at" = $2 WHERE "songs"."id" = $3  [["title", "mysongggg"], ["updated_at", "2020-11-16 16:40:42.256829"], ["id", 11]]

  def destroy
    song = Song.destroy(params[:id])
---
DELETE FROM "songs" WHERE "songs"."id" = $1  [["id", 11]]